In [1]:
import pandas as pd
import numpy as np

In [2]:
student_info = pd.DataFrame({'id': ['st0', 'st1', 'st2', 'st3'],
                             'Name':['Lucy', 'Nancy', 'John', 'Billy'], 
                             'Age':[18, 20, 19, 21]})
student_info

    id   Name  Age
0  st0   Lucy   18
1  st1  Nancy   20
2  st2   John   19
3  st3  Billy   21

In [3]:
student_more = pd.DataFrame({'id': ['st0', 'st1', 'st2', 'st3'],
                             'Address':['District 1', 'District 2', 
                                        'District 3', 'District 4'], 
                             'Mobile':['0903123456', '0989321456', 
                                       '0913753951', '0935468153']})
student_more

    id     Address      Mobile
0  st0  District 1  0903123456
1  st1  District 2  0989321456
2  st2  District 3  0913753951
3  st3  District 4  0935468153

In [6]:
student_marks_1 = pd.DataFrame({'id': ['st0', 'st1', 'st2'],
                             'Maths':[7.5, 8.0, 9.0]})
student_marks_1

    id  Maths
0  st0    7.5
1  st1    8.0
2  st2    9.0

In [7]:
student_marks_2 = pd.DataFrame({'id': ['st1', 'st3'],
                             'English':[8.5, 8.0]})
student_marks_2

    id  English
0  st1      8.5
1  st3      8.0

### Merge default

In [5]:
pd.merge(student_info,student_more)

    id   Name  Age     Address      Mobile
0  st0   Lucy   18  District 1  0903123456
1  st1  Nancy   20  District 2  0989321456
2  st2   John   19  District 3  0913753951
3  st3  Billy   21  District 4  0935468153

### Merge left

In [8]:
pd.merge(student_info,student_marks_1,how='left')

    id   Name  Age  Maths
0  st0   Lucy   18    7.5
1  st1  Nancy   20    8.0
2  st2   John   19    9.0
3  st3  Billy   21    NaN

### Merge right

In [9]:
pd.merge(student_info,student_marks_1,how='right')

    id   Name  Age  Maths
0  st0   Lucy   18    7.5
1  st1  Nancy   20    8.0
2  st2   John   19    9.0

In [10]:
### Merge inner

In [11]:
pd.merge(student_marks_1,student_marks_2)

    id  Maths  English
0  st1    8.0      8.5

In [12]:
### Merge outer

In [13]:
pd.merge(student_marks_1,student_marks_2,how='outer')

    id  Maths  English
0  st0    7.5      NaN
1  st1    8.0      8.5
2  st2    9.0      NaN
3  st3    NaN      8.0

#### Merge different columns name

In [15]:
student_info_1 = student_info.rename({'id':'id_1'}, axis=1)

In [16]:
student_more_1 = student_info.rename({'id':'id_2'}, axis=1)

In [17]:
pd.merge(student_info_1,student_more_1, left_on='id_1', right_on='id_2')

  id_1 Name_x  Age_x id_2 Name_y  Age_y
0  st0   Lucy     18  st0   Lucy     18
1  st1  Nancy     20  st1  Nancy     20
2  st2   John     19  st2   John     19
3  st3  Billy     21  st3  Billy     21

In [18]:
pd.merge(student_info_1,student_more_1, left_index=True, right_index=True)

  id_1 Name_x  Age_x id_2 Name_y  Age_y
0  st0   Lucy     18  st0   Lucy     18
1  st1  Nancy     20  st1  Nancy     20
2  st2   John     19  st2   John     19
3  st3  Billy     21  st3  Billy     21

#### Join default

In [19]:
right = pd.DataFrame(
    {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]
)
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [20]:
left = pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [21]:
left.join(right)

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

#### Combine

In [25]:
df1 = pd.DataFrame({'X': [5, 0], 'Y': [4, 6]})
df2 = pd.DataFrame({'X': [2, 2], 'Y': [3, 3]})

In [26]:
display(df1,df2)

   X  Y
0  5  4
1  0  6

   X  Y
0  2  3
1  2  3

In [27]:
get_bigger = lambda s1, s2 : s1 if s1.sum() > s2.sum() else s2

In [28]:
df1.combine(df2, get_bigger)

   X  Y
0  5  4
1  0  6

In [32]:
def get_smaller(s1, s2):
    if s1.sum() < s2.sum():
        return s1
    else: 
        return s2

In [33]:
df1.combine(df2, get_smaller)

   X  Y
0  2  3
1  2  3

#### Append

In [34]:
df1 = pd.DataFrame({
  "age": [16, 14, 10],
  "qualified": [True, True, True]
})

df2 = pd.DataFrame({
  "age": [55, 40],
  "qualified": [True, False]
})

In [35]:
display(df1,df2)

   age  qualified
0   16       True
1   14       True
2   10       True

   age  qualified
0   55       True
1   40      False

In [36]:
df1.append(df2, ignore_index=True)

C:\Users\AW\AppData\Local\Temp\ipykernel_24052\2149412069.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2, ignore_index=True)

   age  qualified
0   16       True
1   14       True
2   10       True
3   55       True
4   40      False

### Glob function

In [37]:
import glob

In [39]:
filename = glob.glob('./input_data/[0-9]*.csv')

In [40]:
list_df = []
for file in filename:
    df = pd.read_csv(file)
    list_df.append(df)

In [41]:
pd.concat(list_df)

    rank       name  frequency   sex
0      1       Noah        837  Male
1      2  Alexander        747  Male
2      3    William        687  Male
3      4    Michael        680  Male
4      5       Liam        670  Male
..   ...        ...        ...   ...
95    96   Giovanni        168  Male
96    97     Hudson        167  Male
97    98     Camden        165  Male
98    99        Max        164  Male
99   100    Maxwell        155  Male

[201 rows x 4 columns]

In [42]:
pd.concat([pd.read_csv(f) for f in filename])

    rank       name  frequency   sex
0      1       Noah        837  Male
1      2  Alexander        747  Male
2      3    William        687  Male
3      4    Michael        680  Male
4      5       Liam        670  Male
..   ...        ...        ...   ...
95    96   Giovanni        168  Male
96    97     Hudson        167  Male
97    98     Camden        165  Male
98    99        Max        164  Male
99   100    Maxwell        155  Male

[201 rows x 4 columns]

#### Change dtype

In [44]:
student_all = pd.merge(student_info, student_more)
student_all.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       4 non-null      object
 1   Name     4 non-null      object
 2   Age      4 non-null      int64
 3   Address  4 non-null      object
 4   Mobile   4 non-null      object
dtypes: int64(1), object(4)
memory usage: 192.0+ bytes

In [45]:
student_all.Address = student_all.Address.astype('category')

In [46]:
student_all.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       4 non-null      object
 1   Name     4 non-null      object
 2   Age      4 non-null      int64
 3   Address  4 non-null      category
 4   Mobile   4 non-null      object
dtypes: category(1), int64(1), object(3)
memory usage: 368.0+ bytes

In [47]:
student_all = student_all.astype({'Age':float, 'Name':'category'})

In [48]:
student_all.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       4 non-null      object
 1   Name     4 non-null      category
 2   Age      4 non-null      float64
 3   Address  4 non-null      category
 4   Mobile   4 non-null      object
dtypes: category(2), float64(1), object(2)
memory usage: 544.0+ bytes

In [49]:
pd.to_numeric(student_all.Mobile)

0    903123456
1    989321456
2    913753951
3    935468153
Name: Mobile, dtype: int64